memegenerator/app/controllers/memes_controller.rb

SELECT `memes`.* FROM `memes`
---
  def index
    @memes = Meme.all

INSERT INTO `memes` (`created_at`, `first_line`, `image_url`, `meme_type`, `second_line`, `updated_at`) VALUES ('2011-03-26 02:15:40', '\\', 'http://images.memegenerator.net/Instance/Image?imageSize=Medium&instanceID=6550138&generatorName=Why-you-no', 'Y_U_NO', ' ', '2011-03-26 02:15:40')
---
  def create
    @meme = Meme.new(params[:meme])

    if @meme.save